In [52]:
import glob
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [54]:
# PM CPCB DIRECTORY
state_pm2p5 = glob.glob('./Data/PM/CPCB/State/*')
for i in range(len(state_pm2p5)):
    print("State",i,end=': ')
    print(state_pm2p5[i].split('\\')[-1],end=' City ')
    city = glob.glob(state_pm2p5[i]+'/*')
    print(len(city), end = ' Station ')
    
    station  = [glob.glob(city[i]+'/*') for i in range(len(city))]
    
    print(len(station[0])*len(station))

State 0: Bihar City 1 Station 1
State 1: Delhi City 1 Station 7
State 2: Gujarat City 1 Station 1
State 3: Haryana City 1 Station 1
State 4: Karnataka City 1 Station 3
State 5: Maharashtra City 3 Station 3
State 6: Tamil Nadu City 1 Station 2
State 7: Telangana City 1 Station 1
State 8: Uttar Pradesh City 4 Station 4

In [48]:

# Select State
City = glob.glob(state_pm2p5[8]+'/*')

# Select City
Station  = glob.glob(City[2]+'/*')
Station

['./Data/PM/CPCB/State\\Uttar Pradesh\\lucknow\\KV',
 './Data/PM/CPCB/State\\Uttar Pradesh\\lucknow\\lalbhag',
 './Data/PM/CPCB/State\\Uttar Pradesh\\lucknow\\Talkatora']

In [49]:
def aggregate_station_data(dfs):
    
    # Append ALL Station Data
    df_combined = dfs[0]
    for i in range(1, len(dfs)):
        df_combined = pd.merge(df_combined, dfs[i], on=['From Date','To Date'], suffixes=('', f'_{i+1}'))
    
    # Replace None with NaN for mean calculation
    df_combined.replace('None', np.nan, inplace=True)
    
    # taking mean of col 2 to last col 
    df_combined['mean_PM2.5'] = df_combined.iloc[:, 2:].mean(axis=1)
    
    # Drop all station col and select mean & date col only
    df_combined = df_combined[['From Date','To Date','mean_PM2.5']]
    
    # Renaming Mean PM2.5 to PM2.5
    df_combined = df_combined.rename(columns={'mean_PM2.5':'PM2.5'})
    
    return df_combined

# APPENDING ALL STATION DATAFRAME IN A LIST
df_list = []
for idx,s in enumerate(Station):
    file_path  = glob.glob(s+'/*')[0]
    df = pd.read_excel(file_path,skiprows=range(0,16))
    #df = df.drop('To Date', axis=1)
    #df = df.rename(columns = {'From Date':'Date'})
    df_list.append(df)
    print(f'Station Data {idx} Loaded')
    
df = aggregate_station_data(df_list)

Station Data 0 Loaded
Station Data 1 Loaded
Station Data 2 Loaded

In [50]:
df

               From Date           To Date       PM2.5
0       01-01-2014 00:00  01-01-2014 00:15         NaN
1       01-01-2014 00:15  01-01-2014 00:30         NaN
2       01-01-2014 00:30  01-01-2014 00:45         NaN
3       01-01-2014 00:45  01-01-2014 01:00         NaN
4       01-01-2014 01:00  01-01-2014 01:15         NaN
...                  ...               ...         ...
280412  30-12-2021 23:00  30-12-2021 23:15  174.433333
280413  30-12-2021 23:15  30-12-2021 23:30  170.000000
280414  30-12-2021 23:30  30-12-2021 23:45  146.200000
280415  30-12-2021 23:45  31-12-2021 00:00         NaN
280416  31-12-2021 00:00  31-12-2021 00:00  136.100000

[280417 rows x 3 columns]

In [51]:
# Store Data Frame into excel file

city_name = 'lucknow_'
file_name  = f'./Data/PM/CPCB/combined_station_data/{city_name}.xlsx'

# Writing File to destination Location

#df.to_excel(file_name, index=False,startrow=16)
print("EXCEL FILE CREATED!!!!")

EXCEL FILE CREATED!!!!